{
  "studentFees": {
    "new": 200,
    "existing": 175
  },
  "membershipFees": {
    "new": 35,
    "existing": 25,
    "life": 250,
    "existingLife": 0
  },
  "discounts": {
    "teacherVolunteer": 50
  },
  "paymentModes": {
    "check": {
      "fee": 0,
      "percentage": 0
    },
    "paypal": {
      "fee": 0.49,
      "percentage": 2.99
    }
  },
  "feeStructure": {
    "title": "Fee Structure",
    "formula": "Total Fees to be Paid = A + B – C",
    "sections": {
      "A": {
        "title": "ETP Yearly School Fee"
      },
      "B": {
        "title": "TAGDV Membership Fee (Per Family)",
        "description": "Exton Tamil School is part of Tamil Association of Greater Delaware Valley (TAGDV), and membership in TAGDV is mandatory for all students. The school will create membership for all student families, allowing our students to participate in TAGDV events throughout the year.",
        "note": "Membership fee calculated per family, no need to include for sibling's fee",
        "categories": [
          {
            "category": "New Membership Fee"
          },
          {
            "category": "Existing Membership Renewal Fee"
          },
          {
            "category": "Life Membership Fee"
          },
          {
            "category": "Existing Life Member"
          }
        ]
      },
      "C": {
        "title": "Teacher Volunteer Discount",
        "description": "Since full-time teacher families receive a $50 discount on school fees (applicable to any one student in the family), they may deduct $50 from the total fee and pay the remaining balance."
      }
    }
  },
  "paymentInstructions": {
    "title": "Modes of Payment",
    "check": {
      "title": "By Check (Recommended)",
      "description": "Parents can provide single consolidated check to pay the school fees and membership fees.",
      "steps": [
        "Check should be payable to \"TAGDV-ETP\"",
        "Check should have the details about Student Registration ID; New students kindly include Full Name of the student"
      ],
      "collectionInfo": "We'll arrange 2 or 3 pre-informed check collection drives. The dates, times, and locations of the drives will be communicated after registration."
    },
    "paypal": {
      "title": "By PayPal:",
      "fee": "PayPal charges 2.99% + $0.49 per transaction. Please include that if you are paying through this option. In the fee calculator, select the option as PayPal to find the exact amount to be transferred",
      "description": "If you have a PayPal account, you may send the payment to the PayPal address provided below.",
      "email": "treasurer.etp@s.tagdv.org",
      "note": "The Notes section should include the Student Registration ID. New students are kindly requested to provide the full name of the student.",
      "confirmationNote": "Please send us a confirmation email, once you have completed the transaction."
    }
  }
}
